"MyColorNEFilterDispName" = "Makoto's Color Filter";
"MyColorNEFilterDesc" = "Modifies saturation and lightness of particular hue.";
"HueDegree" = "Hue";
"HueRange" = "Hue Range";
"SaturationMax" = "Max Saturation";
"SaturationPt1" = "Mid-1 Saturation";
"SaturationPt2" = "Mid-2 Saturation";
"SaturationMin" = "Min Saturation";
"LightnessMax" = "Max Lightness";
"LightnessPt1" = "Mid-1 Lightness";
"LightnessPt2" = "Mid-2 Lightness";
"LightnessMin" = "Min Lightness";

"MyColorNEFilter2DispName" = "Makoto's Saturation Filter";
"MyColorNEFilter2Desc" = "Modifies saturation of particular hues.";

"MyColorNEFilter3DispName" = "Makoto's Lightness Filter";
"MyColorNEFilter3Desc" = "Modifies lightness of particular hues.";

"RedMid" = "Red";
"OrangeMid" = "Orange";
"YellowMid" = "Yellow";
"GreenYellowMid" = "Green Yellow";
"GreenMid" = "Green";
"GreenCyanMid" = "Green Cyan";
"CyanMid" = "Cyan";
"BlueCyanMid" = "Blue Cyan";
"BlueMid" = "Blue";
"BlueMagentaMid" = "Blue Magenta";
"MagentaMid" = "Magenta";
"RedMagentaMid" = "Red Magenta";

"MyColorNEFilter4DispName" = "Makoto's Alpha Filter";
"MyColorNEFilter4Desc" = "Modifies alpha of particular lum.";
"AlphaAtLum0" = "Alpha at Lum 0";
"AlphaAtLumHlf" = "Alpha at Lum 0.5";
"AlphaAtLum1" = "Alpha at Lum 1";
